sim/rhoReactingCentralFoam/1000_3_fixed/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme		Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
	default         Gauss linear;
}

divSchemes
{
    	default         none;
		div(tauMC)		Gauss linear;
		div(phi,O2)		Gauss linear;
		div(phi,H2)		Gauss linear;
		div(phi,H2O)	Gauss linear;
		div(phi,N2)		Gauss linear;
}

laplacianSchemes
{
		default			Gauss linear corrected;	
}

interpolationSchemes
{
    	default				linear;
		reconstruct(rho)	vanAlbada;
		reconstruct(U)		vanAlbadaV;
		reconstruct(T)		vanAlbada;
}

snGradSchemes
{
		default				corrected;
}


// ************************************************************************* //
